tutorials/pM4F-Benchmarks/case3/dbsFoam/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;
mu              mu [ 1 -1 -1 0 0 0 0 ] 1e-3;
rho              rho [ 1 -3 0 0 0 0 0 ] 1000;
nu 		nu [0 2 -1 0 0 0 0] 1e-6;

geochemicalProperties
{
rhol              rhol [ 1 -3 0 0 0 0 0 ] 1000;

 geochemicalModel phreeqcRM;

 mineral (Calcite);

 absolutePermeabilityModel KozenyCarman;
 KozenyCarmanCoeffs
 {
	K0 K0 [0 2 0 0 0 0 0] 1.18602e-11;
 }

 dispersionModel none;

 CalciteProperties
 {
	activatePhaseEquilibrium false;
	rhos rhos [1 -3 0 0 0 0 0] 2707;
	Vm Vm [0 3 0 0 -1 0 0] 36.93336e-6;
	surfaceAreaModel mingliangLaw;
	mingliangLawCoeffs
	{
	 A0 A0 [0 -1 0 0 0 0 0] 0.1;
	 n 0.667;
	 initVF 0.3;
	}
 }

 phreeqcRM
 {
        PhreeqcInputFile "phreeqcInput"; 
        PhreeqcDataBase  "dbs";
        activateUpdatePorosity true;
	StrangSteps 6;
 }

}

// ************************************************************************* //
