tutorials/pM4F-Benchmarks/case3/dbsFoam/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
ddtSchemes
{
    default         Euler; //none;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss upwind; //Gauss linearUpwind grad(U);
    div((nu*dev2(T(grad(U)))))  Gauss linear;
    div((nuM*grad(U)))          Gauss linear;
        div((nuEff*dev2(T(grad(U)))))   Gauss linear;
//    div(phi,Yi)      Gauss vanLeer phi;
    div(phi,Yi)      Gauss upwind; //linear vanLeer;//linear upwind;
}

laplacianSchemes
{
    default         Gauss linear uncorrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         uncorrected;
}

